#include <iostream>
using namespace std;
int main()
{
	cout << "本程序可以实现+ - * / %的运算" << endl;//首先声明程序的功能
	cout << "求余运算中如果运算数出现小数，将保留整数部分" << endl;//求余运算的两个运算数都要求是整数，故要提前声明若出现小数，将只保留整数进行求余运算
	double a, b, c;//定义双精度浮点数a,b,c
	char f;//定义字符型变量用来赋予运算符
	cout << "请输入第一个运算数" << endl;
	cin >> a;//输入第一个运算数
	cout << "请输入运算符" << endl;
	cin >> f;//输入运算符
	cout << "请输入第二个运算数" << endl;
	cin >> b;//输入第二个运算数
	if (f == '+')//若运算符为加号
	{
		c = a + b;//进行加法运算，将结果赋值给c
	}
	else if (f == '-')//若运算符为减号
	{
		c = a - b; //进行减法运算，将结果赋值给c
	}
	else if (f == '*')//若运算符为乘号
	{
		c = a * b;//进行乘法运算，将结果赋值给c
	}
	else if (f == '/')//若运算符为除号
	{
		c = a / b;//进行除法运算，将结果赋值给c
	}
	else if (f == '%')//若运算符为求余号
	{
		c = (int(a)) % (int(b));//进行求余运算，将结果赋值给c
	}
	else//若输入的运算符不在程序规定的运算符范围内
	{
		cout << "你输入的运算符非法，不在规定运算符行列内" << endl;//判定输入的运算符非法
	}
	cout << "运算结果为" << c << endl;//输出运算结果c
	return 0;
}