#include <iostream>
using namespace std;
int main()
{

    int a;
    int eng = 0, spa = 0, num = 0, oth = 0;//分别定义四个整型变量，用来统计所输入的字符中英文字母、空格、数字字符和其他字符的个数

    cout << "本程序可以统计你所输入的字符中英文字母、空格、数字字符和其他字符的个数" << endl;//声明本程序的功能
    while ((a = cin.get()) != 10)//利用while循环和a=cin.get()逐个读取所输入的字符串中每个字符的ascII码值并赋值给a。只要a的值不等于10，即未读取到回车字符，即可不断进行while循环
    {
        if ((a >= 65 && a <= 90) || (a >= 97 && a <= 122))//若a值在英文字母的ascII值范围中，说明所读取的字符为英文字母
        {
            ++eng;//给英文字母计数变量eng加1
        }
        else if (a == 32)//若a的值等于空格字符的ascII值，说明所读取的字符为空格字符
        {
            ++spa;//给空格计数变量spa加1
        }
        else if (a >= 48 && a <= 57)//若a值在数字字符的ascII值范围中，说明所读取的字符为数字字符
        {
            ++num;//给数字字符技术变量spa加1
        }
        else//若a的值不在上述任何判定条件范围中，说明所输入的字符不属于任何上述字符种类，故属于其他字符
        {
            ++oth;//给其他字符计数变量oth加一
        }

    }
    cout << "你所输入的字符中英文字母有" << eng << "个，" << "空格有" << spa << "个，" << "数字字符有" << num << "个，" << "其他字符有" << oth << "个。" << endl;//输出统计后英文字母、空格、数字字符和其他字符的个数
    return 0;
}

